Repository: dilancroos/python-docs-si
Catalog: about.po
Languages: si_lk

source: About these documents
si_lk: මෙම ලේඛනාවේ පිළිබඳව

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
si_lk: මෙම ලේඛනය, Python ප්‍රලේඛනය සඳහා විශේෂයෙන් ලියා ඇති ලේඛන සකසනයක් වන `Sphinx`_ මගින් `reStructuredText`_ මූලාශ්‍රවලින් ජනනය කර ඇත.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
si_lk: ලේඛනගත කිරීම සහ එහි මෙවලම් දාමය සංවර්ධනය කිරීම Python මෙන්ම සම්පූර්ණයෙන්ම ස්වේච්ඡා උත්සාහයකි. ඔබට දායක වීමට අවශ්‍ය නම්, එසේ කරන්නේ කෙසේද යන්න පිළිබඳ තොරතුරු සඳහා කරුණාකර :ref:`reporting-bugs` පිටුව බලන්න. නව ස්වේච්ඡා සේවකයන් සැමවිටම සාදරයෙන් පිළිගනිමු!

source: Many thanks go to:
si_lk: ස්තුති කළ යුතු අය:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
si_lk: Fred L. Drake, Jr., මුල් Python ලේඛන මෙවලම් කට්ටලයේ නිර්මාතෘ සහ බොහෝ අන්තර්ගතයන් ලියා ඇත්තේ ඔවුන් විසිනි;

source: the `Docutils <https://docutils.sourceforge.io/>`_ project for creating reStructuredText and the Docutils suite;
si_lk: `ReStructuredText` සහ `Docutils` කට්ටලය නිර්මාණය කිරීම සඳහා `Docutils <https://docutils.sourceforge.io/>`_ ව්‍යාපෘතිය;

source: Fredrik Lundh for his Alternative Python Reference project from which Sphinx got many good ideas.
si_lk: Fredrik Lundh ඔහුගේ විකල්ප Python විමර්ශන ව්‍යාපෘතිය සඳහා Sphinx හට බොහෝ හොඳ අදහස් ලැබුණි.

source: Contributors to the Python Documentation
si_lk: Python ප්‍රලේඛනය සඳහා දායකයින්

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
si_lk: Python පරිගණක භාෂාව, Python සම්මත පුස්තකාලය සහ Python ලේඛනගත කිරීම සඳහා බොහෝ දෙනෙක් දායක වී ඇත. දායකයින්ගේ අර්ධ ලැයිස්තුවක් සඳහා පයිතන් මූලාශ්‍ර බෙදාහැරීමේ :source:’Misc/ACKS’ බලන්න.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
si_lk: Python ප්‍රජාවගේ ආදානය සහ දායකත්වය නිසා පයිතන් සතුව මෙතරම් හොඳ ලේඛනගත කිරීමක් ඇත — ස්තූතියි!
